_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cropping2d_1 (Cropping2D)    (None, 80, 320, 3)        0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 128, 128, 3)       0         
_________________________________________________________________
lambda_2 (Lambda)            (None, 128, 128, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 128, 128, 3)       12        
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 64, 32)        4736      
_________________________________________________________________
elu_1 (ELU)                  (None, 64, 64, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 29, 29, 32)        50208     
_________________________________________________________________
elu_2 (ELU)                  (None, 29, 29, 32)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 29, 29, 32)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 29, 29, 64)        51264     
_________________________________________________________________
elu_3 (ELU)                  (None, 29, 29, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 27, 27, 64)        36928     
_________________________________________________________________
elu_4 (ELU)                  (None, 27, 27, 64)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 27, 27, 64)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 46656)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               5972096   
_________________________________________________________________
elu_5 (ELU)                  (None, 128)               0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                8256      
_________________________________________________________________
elu_6 (ELU)                  (None, 64)                0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 8)                 520       
_________________________________________________________________
elu_7 (ELU)                  (None, 8)                 0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 9         
=================================================================
Total params: 6,124,029
Trainable params: 6,124,029
Non-trainable params: 0
_________________________________________________________________
